Repository: abeek1/61439-3_2024
Catalog: tm/EVS-EN_61439-1_2021/EVS-EN_61439-1_2021_11_Routine verification, no tables_11 TAVAKONTROLL, tabelid puudu .tmx
Source language: en
Languages: et

source: Routine verification
et: TAVAKONTROLL

source: 11.1 General
et: 11.1 Üldnõuded

source: Under the responsibility of the assembly manufacturer, all routine verification including testing, installation and commissioning shall be carried out or supervised by a competent person.
et: Kooste tootja vastutusel toimuva kogu tavakontrolli, mis sisaldab katsetamist, paigaldamist ja vastuvõttu, peab sooritama või juhendama kompetentne isik.

source: Routine verification is intended to detect faults in materials and workmanship and to ascertain proper functioning of the manufactured assembly.
et: Tavakontroll on ette nähtud materjali- ja valmistamisdefektide tuvastamiseks ning toodetud kooste nõuetekohase toimivuse kinnitamiseks.

source: It is made on every assembly.
et: See sooritatakse kõigile koostetele.

source: The assembly manufacturer shall determine if routine verification is carried out during and/or after manufacture.
et: Kooste tootja peab määrama, kas tavakontroll sooritatakse kooste valmistamise ajal ja/või pärast kooste valmimist.

source: Routine verification shall confirm that the assembly manufacturing instructions have been adhered to.
et: Tavakontroll peab kinnitama, et kooste tootmisjuhenditest on kinni peetud.

source: Routine verification is not required to be carried out on devices and self-contained components incorporated in the assembly when they have been selected in accordance with 8.5.3 and installed in accordance with 8.5.4.
et: Tavakontroll ei ole nõutav koostesse ühendatud seadmete ja isekandvate komponentide suhtes, mis on valitud vastavalt jaotisele 8.5.3 ja paigaldatud vastavalt jaotisele 8.5.4.

source: Verification shall comprise the following categories:
et: Kontroll peab sisaldama järgmisi kategooriaid

source: a) Construction (see 11.2 to 11.8):
et: a) konstruktsiooni osas (vt jaotised 11.2 kuni 11.8)

source: 1) degree of protection against contact with hazardous live parts, ingress of solid foreign bodies and water of enclosures;
et: 1) kaitseastet kokkupuute eest ohtlike pingestatud osadega ning võõrkehade ja vee sissepääsu eest ümbristesse;

source: 2) clearances and creepage distances;
et: 2) õhk- ja roomevahemikke;

source: 3) protection against electric shock and integrity of protective circuits;
et: 3) kaitset elektrilöögi eest ja kaitseahelate terviklikkust;

source: 4) incorporation of built-in components;
et: 4) sisseehitatud komponentide komplektsust;

source: 5) internal electrical circuits and connections;
et: 5) sisemisi elektriahelaid ja ühendusi;

source: 6) terminals for external conductors;
et: 6) välisjuhtide klemme;

source: 7) mechanical operation.
et: 7) mehaanilist talitlust;

source: b) Performance (see 11.9 to 11.10):
et: b) toimivuse osas (vt jaotised 11.9 kuni 11.10)

source: 1) dielectric properties;
et: 1) dielektrilisi omadusi;

source: 2) wiring, operational performance and function.
et: 2) juhistikku, talitluslikku toimivust ja funktsioone.

source: 11.2 Degree of protection against contact with hazardous live parts, ingress of solid foreign bodies and water of enclosures
et: 11.2 Kaitseaste kokkupuute eest ohtlike pingestatud osadega ning võõrkehade ja vee sissepääsu eest ümbristesse

source: A visual inspection is necessary to confirm that the assembly meets the prescribed measures to achieve the designated degree of protection.
et: On vaja visuaalset ülevaatust kinnitamaks, et kooste vastab ettekirjutatud meetmetele sätestatud kaitseastme saavutamiseks.

source: 11.3 Clearances and creepage distances
et: 11.3 Õhk- ja roomevahemikud

source: Where the clearances are:
et: Kui õhkvahemikud on

source: – less than the values given in Table 1, an impulse voltage withstand test in accordance with 10.9.3 shall be carried out;
et: — väiksemad kui tabelis 1 esitatud väärtused, tuleb sooritada jaotise 10.9.3 kohane impulsstaluvuspinge katsetus;

source: – not evident by visual inspection to be larger than the values given in Table 1 (see 10.9.3.5), verification shall be by physical measurement or by an impulse voltage withstand test in accordance with 10.9.3;
et: — visuaalsel ülevaatusel jäänud selguseta, kas need on laiemad kui tabelis 1 esitatud väärtused (vt jaotis 10.9.3.5), tuleb kontroll sooritada füüsikalise mõõtmisega või impulsstaluvuspinge katsetusega vastavalt jaotisele 10.9.3;

source: – evidently larger by visual inspection than the values given in Table 1, verification may be carried out only by visual inspection.
et: — visuaalsel ülevaatusel ilmselgelt laiemad kui tabelis 1 esitatud väärtused, võib kontroll piirduda üksnes visuaalse ülevaatusega.

source: The prescribed measures with regard to creepage distances (see 8.3.3) shall be subject to a visual inspection.
et: Roomevahemike kohta ette kirjutatud meetmeid (vt jaotis 8.3.3) tuleb kontrollida visuaalse ülevaatusega.

source: Where it is not evident by visual inspection, verification shall be by physical measurement.
et: Kui see ei ole visuaalse ülevaatuse teel selge, tuleb kontroll sooritada füüsikalise mõõtmise teel.

source: No reduction on the values given in Table 2 is acceptable.
et: Tabelis 2 esitatud väärtuste vähendamine ei ole vastuvõetav.

source: 11.4 Protection against electric shock and integrity of protective circuits The prescribed protective measures with regard to basic protection and fault protection (see 8.4.2 and 8.4.3) shall be subject to a visual inspection.
et: 11.4 Kaitse elektrilöögi eest ja kaitseahelate terviklikkus Ettekirjutatud kaitseviise, mis arvestavad põhi- ja rikkekaitset (vt jaotised 8.4.2 ja 8.4.3) tuleb kontrollida visuaalse ülevaatuse teel.

source: The protective circuits shall be checked by inspection to ascertain that the measures prescribed in the manufacturer’s instructions are adhered to and verified.
et: Kaitseahelaid tuleb kontrollida ülevaatusega veendumaks, et tootja ettekirjutatud meetmeid on silmas peetud ja kontrollitud.

source: When it is not obvious by inspection that the earth continuity of the protective circuits meets the requirement of 8.4.3.2, a continuity test according to 10.5.2 shall be made.
et: Kui ülevaatusel ei ole silmnähtav, et kaitseahelate maanduse pidevus vastab jaotise 8.4.3.2 nõudele, tuleb sooritada pidevuse katsetus jaotise 10.5.2 järgi.

source: Screwed and bolted connections shall be checked for the correct tightness on a random basis.
et: Kruvi- ja poltühendusi tuleb pisteliselt kontrollida nende õige pingulduse suhtes.

source: 11.5 Incorporation of built-in components The installation and identification of built-in components shall be in accordance with the assembly’s manufacturing instructions.
et: 11.5 Sisseehitatud komponentide komplektsus Sisseehitatud komponentide paigaldus ja tuvastatavus peab olema kooskõlas kooste tootmisjuhistega.

source: 11.6 Internal electrical circuits and connections The connections, especially screwed and bolted connections, shall be checked for the correct tightness on a random basis.
et: 11.6 Sisemised elektriahelad ja ühendused Ühenduste, eriti kruvi- ja poltühenduste puhul tuleb pisteliselt kontrollida nende õiget pinguldust.

source: Conductors shall be checked in accordance with the assembly’s manufacturing instructions.
et: Juhte tuleb kontrollida kooskõlas kooste tootmisjuhistega.

source: 11.7 Terminals for external conductors The number, type and identification of terminals shall be checked in accordance with the assembly’s manufacturing instructions.
et: 11.7 Välisjuhtide klemmid Klemmide arvu, liiki ja tuvastatavust tuleb kontrollida kooskõlas kooste tootmisjuhistega.

source: 11.8 Mechanical operation The effectiveness of mechanical actuating elements, interlocks and locks, including those associated with removable parts, shall be checked.
et: 11.8 Mehaaniline talitlus Tuleb kontrollida mehaaniliste täiturelementide, blokeeringute ja lukkude tõhusust, sealhulgas eemaldatavate osadega seotuse korral.

source: Where a device's operating handle is used to indicate the switching position of the device, and it detaches from the device when the door is open, it shall be confirmed that, when the door is closed, the handle provides positive and unambiguous indication of the device's open and closed positions.
et: Kui seadise talitluskäepidet kasutatakse seadise lülitusseisundi tähistamiseks ja kui see ukse avamise korral eraldub seadisest, peab olema kindel, et kui uks on suletud, näitab käepide jaatavalt ning ühemõtteliselt seadise sisse- ja väljalülitatud seisundit.

source: 11.9 Dielectric properties
et: 11.9 Dielektrilised omadused

source: A power-frequency withstand test shall be performed on all circuits in accordance with 10.9.1 and 10.9.2 but for a duration of 1 s and with a tripping current not less than 3,5 mA.
et: Kõigi ahelatega tuleb sooritada võrgusageduslik taluvuskatsetus kooskõlas jaotistega 10.9.1 ja 10.9.2, kuid kestusega 1 s ja vabastusvooluga mitte alla 3,5 mA.

source: This test need not be made on auxiliary circuits:
et: Seda katsetust ei ole vaja sooritada abiahelate puhul,

source: – that are protected by a short-circuit protective device with a rating not exceeding 16 A;
et: — mis on kaitstud lühisekaitseaparaadiga, mille tunnusvool ei ole üle 16 A;

source: – if an electrical function test has been made previously at the rated operational voltage for which the auxiliary circuits are designed.
et: — kui varem on ettenähtud tunnus-talitluspingel, millele abiahelad on projekteeritud, sooritatud elektriline toimivuskatsetus.

source: As an alternative for assemblies with incoming protection rated up to 630 A and a rated voltage Un not exceeding 500 V, the verification of insulation resistance may be by measurement using an insulation measuring device at a voltage of at least 500 V DC.
et: Alternatiivina võib koostete puhul, mille sisendkaitse tunnusvool on kuni 630 A ja tunnuspinge Un ei ole üle 500 V, isolatsioonitakistuse kontrolli sooritada mõõtmisega, kasutades isolatsiooni mõõteriista alalispingega vähemalt 500 V.

source: In this case, the test is satisfactory if the insulation resistance between circuits and exposedconductive-parts is at least 1 M.
et: Katsetus on rahuldav sel juhul, kui isolatsioonitakistus ahelate ja pingealdiste juhtivate osade vahel on vähemalt 1 MΩ.

source: 11.10 Wiring, operational performance and function It shall be verified that the information and markings specified in Clause 6 are complete.
et: 11.10 Juhistik, talitluslik toimivus ja funktsioonid Tuleb kontrollida, kas peatükis 6 sätestatud teave ja märgistus on täielikult olemas.

source: Depending on the complexity of the assembly, it may be necessary to inspect the wiring and to carry out an electrical function test.
et: Sõltuvalt kooste komplektsusest võib vaja olla juhistik üle vaadata ja sooritada elektriline toimivuskatsetus.

source: The test procedure and the number of tests depend on whether or not the assembly includes complicated interlocks, sequence control facilities, etc.
et: Katsetusprotseduur ja katsetuste arv sõltub sellest, kas koostel on või ei ole keerukaid blokeeringuid, järjestusjuhtimisseadmeid jne.

source: By agreement between the user and the assembly manufacturer, communicating devices that are included and connected in a system within the assembly may need to be checked for basic operation and functionality.
et: Kasutaja ja kooste tootja kokkuleppe korral võib vaja olla kontrollida kooste ulatuses sisalduvate ja sellega süsteemi ühendatud kommunikatsiooniseadiste põhitalitlust ja funktsionaalsust.

source: In some cases, it may be necessary to make or repeat this test on site before putting the installation into operation.
et: Mõnikord võib vaja olla sooritada või korrata seda katsetust enne paigaldise käituvõtmist.

source: Table 1 – Minimum clearances in air (8.3.2)
et: Tabel 1 — Vähimad õhkvahemikud (jaotis 8.3.2)
